# Assignment #2: Data Exploration

In this assignment, you will demonstrate your knowledge of the Python and Pandas skills we've learned so far. These include:

- Getting an overview of your data
- Extracting columns
- Removing duplicates from your data
- Creating a subset of your data by matching a string
- Getting a random sample of your data
- Sorting your data 
- Getting fundamental statistical information of a series, such as the mean and median

You will not need to formulate or answer a research question for this assignment. You simply need to demonstrate your ability to perform specific operations on the data set you have selected. In the next assignment, your midterm, you will create a narrative exploration of the data using many of the same methods, but in such a way as to use narrative along with data analysis to answer a research question.

You may use the data set you imported in assignment #1, or you may choose another data set. That means that you can reuse code you wrote in Assignment #1 to import the data.

In the below notebook, I will ask for you to perform a task. Each task will be followed by one or more blank code cells. Use as many cells as you need to complete the task. If you know some other way to complete the task with Python and/or Pandas that is not the way we learned in class, that is also acceptable. Feel free to use Google searches to refresh your memory as to how to perform each task. You will also likely wish to consult the class notebooks, which can be found in [our class repository on GitHub](https://github.com/sha256rma/foundations-of-data-science).

If your data set does not have a needed form of data for a task, write code that would perform the task if a column with that data existed, and provide an explanation as a comment or markdown cell.

You may receive partial credit for some incomplete or incorrect answers. Please feel free to add comments about your thought process, which will make it more likely that you will receive partial credit.

The last cell is a bonus. You will not be penalized for not attempting or completing it.

-----

Import Pandas and read your data in as a data frame. Assign the data frame to a variable, such as `df`.

Make the data frame visible by placing the data frame variable in a cell by itself.

In [10]:
import pandas as pd

In [126]:
import pandas

df = pandas.read_csv('./Car Theft Locations.csv')

df

    location_id              region      country population  density
0           101           Northland  New Zealand    201,500    16.11
1           102            Auckland  New Zealand  1,695,200   343.09
2           103             Waikato  New Zealand    513,800    21.50
3           104       Bay of Plenty  New Zealand    347,700    28.80
4           105            Gisborne  New Zealand     52,100     6.21
5           106         Hawke's Bay  New Zealand    182,700    12.92
6           107            Taranaki  New Zealand    127,300    17.55
7           108  Manawatū-Whanganui  New Zealand    258,200    11.62
8           109          Wellington  New Zealand    543,500    67.52
9           110              Tasman  New Zealand     58,700     6.10
10          111              Nelson  New Zealand     54,500   129.15
11          112         Marlborough  New Zealand     51,900     4.94
12          113          West Coast  New Zealand     32,700     1.41
13          114          Canterbury  New Zealand    655,000    14.72
14          115               Otago  New Zealand    246,000     7.89
15          116           Southland  New Zealand    102,400     3.28

What columns are in your data frame? Use a function or method that shows all the columns.

In [129]:
df.iloc[0:0]

Empty DataFrame
Columns: [location_id, region, country, population, density]
Index: []

Write Python code to output the number of rows in your data frame.

In [132]:
row_count = len(df)

In [134]:
print(row_count)

16

Write code to output a column from your data frame as a series. (Extract a column.)

In [137]:
name_column = df["location_id"]

In [139]:
print(name_column)

0     101
1     102
2     103
3     104
4     105
5     106
6     107
7     108
8     109
9     110
10    111
11    112
12    113
13    114
14    115
15    116
Name: location_id, dtype: int64

### Read the example below to **count** duplicates based on specific columns (e.g., 'Name' and 'Age')

Check duplicates based on 'Name' and 'Age' columns (modify the subset for your own columns):

`duplicates_subset = df.duplicated(subset=['Name', 'Age'])`

Count the number of duplicates in the subset:

`num_duplicates_subset = duplicates_subset.sum()`

Display no. of duplicate rows based on your column(s):

`print(f"\nNumber of duplicate rows based on 'Name' and 'Age': {num_duplicates_subset}")`

After reading the above, modify the code snippets to check for duplicate columns in your own data frame

In [126]:
import pandas

df = pandas.read_csv('./Car Theft Locations.csv')

df

    location_id              region      country population  density
0           101           Northland  New Zealand    201,500    16.11
1           102            Auckland  New Zealand  1,695,200   343.09
2           103             Waikato  New Zealand    513,800    21.50
3           104       Bay of Plenty  New Zealand    347,700    28.80
4           105            Gisborne  New Zealand     52,100     6.21
5           106         Hawke's Bay  New Zealand    182,700    12.92
6           107            Taranaki  New Zealand    127,300    17.55
7           108  Manawatū-Whanganui  New Zealand    258,200    11.62
8           109          Wellington  New Zealand    543,500    67.52
9           110              Tasman  New Zealand     58,700     6.10
10          111              Nelson  New Zealand     54,500   129.15
11          112         Marlborough  New Zealand     51,900     4.94
12          113          West Coast  New Zealand     32,700     1.41
13          114          Canterbury  New Zealand    655,000    14.72
14          115               Otago  New Zealand    246,000     7.89
15          116           Southland  New Zealand    102,400     3.28

In [270]:
duplicates_subset = df.duplicated(subset=["location_id", "country"])

In [272]:
print(duplicates_subset)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
dtype: bool

In [250]:
num_duplicates_subset = duplicates_subset.sum()

In [252]:
print(num_duplicates_subset)

0

## (ERROR) Invalid Syntax. Perhaps you forgot a comma ??? ##

In [268]:
print(f"\nNumber of duplicate if rows based on "location_id" and "region": {num_duplicates_subset}")

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1506063327.py, line 1)

If any duplicates exist within a column, remove them with the `.drop_duplicates()` function

Write Python code to output the number of rows in your data frame.

In [258]:
num_row = len(df)

In [260]:
print(num_row)

16

Compare the new value with the first time you outputted the number of rows above. Is it more, less, or the same?

## The value is the same. ##

Create a subset of the data that matches a specific string in a column. That is, extract all rows of the original data frame that contain a specific string in one of the columns. Save the resulting data frame to a variable. (Add more cells if needed)

In [274]:
duplicates_subset = df.duplicated(subset=["location_id", "country"])

In [277]:
print(duplicates_subset)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
dtype: bool

Output the length of the resulting data frame (the subset of your data for which the conditional was true).

## All of my subset data conditions were false ##

Output the first ten rows of your data set, the last ten rows of your data set, and a random ten rows of your data set (a sample of your data).

In [240]:
df.iloc[0:10]

   location_id              region      country population  density
0          101           Northland  New Zealand    201,500    16.11
1          102            Auckland  New Zealand  1,695,200   343.09
2          103             Waikato  New Zealand    513,800    21.50
3          104       Bay of Plenty  New Zealand    347,700    28.80
4          105            Gisborne  New Zealand     52,100     6.21
5          106         Hawke's Bay  New Zealand    182,700    12.92
6          107            Taranaki  New Zealand    127,300    17.55
7          108  Manawatū-Whanganui  New Zealand    258,200    11.62
8          109          Wellington  New Zealand    543,500    67.52
9          110              Tasman  New Zealand     58,700     6.10

In [238]:
df.loc[6:17]

    location_id              region      country population  density
6           107            Taranaki  New Zealand    127,300    17.55
7           108  Manawatū-Whanganui  New Zealand    258,200    11.62
8           109          Wellington  New Zealand    543,500    67.52
9           110              Tasman  New Zealand     58,700     6.10
10          111              Nelson  New Zealand     54,500   129.15
11          112         Marlborough  New Zealand     51,900     4.94
12          113          West Coast  New Zealand     32,700     1.41
13          114          Canterbury  New Zealand    655,000    14.72
14          115               Otago  New Zealand    246,000     7.89
15          116           Southland  New Zealand    102,400     3.28

## Bonus

You may want to refer to the [Pandas Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf).

Sort your data frame by a particular column and output the result.

Pick a column in your data set with numeric data (integers or floats). Output the mean (average) and median of that column.